Repository: mrlaige04/LetItBuy
Catalog: Shop/Resources/SharedResource.*.resx
Languages: de

source: A user with this login already exists.
de: Ein Benutzer mit diesem Login existiert bereits.

source: An unknown failure has occurred.
de: Ein unbekannter Fehler ist aufgetreten.

source: Email '{email}' is already taken.
de: E-Mail '{email}' ist bereits vergeben.

source: Email '{email}' is invalid.
de: E-Mail '{email}' ist ungültig.

source: Incorrect password.
de: Falsches Passwort.

source: Invalid token.
de: Ungültiges Token.

source: Lockout is not enabled for this user.
de: Die Sperrung ist für diesen Benutzer nicht aktiviert.

source: Optimistic concurrency failure, object has been modified.
de: Optimistischer Parallelitätsfehler, Objekt wurde geändert.

source: PasswordLength
de: Passwörter müssen mindestens {0} Zeichen lang sein.

source: Passwords must have at least one digit ('0'-'9').
de: Passwörter müssen mindestens eine Ziffer ('0'-'9') haben.

source: Passwords must have at least one lowercase ('a'-'z').
de: Passwörter müssen mindestens einen Kleinbuchstaben ('a'-'z') enthalten.

source: Passwords must have at least one non alphanumeric character.
de: Passwörter müssen mindestens ein nicht alphanumerisches Zeichen enthalten.

source: Passwords must have at least one uppercase ('A'-'Z').
de: Passwörter müssen mindestens einen Großbuchstaben ('A'-'Z') enthalten.

source: Role name '{role}' is already taken.
de: Der Rollenname „{role}“ ist bereits vergeben.

source: Role name '{role}' is invalid.
de: Der Rollenname „{role}“ ist ungültig.

source: User already has a password set.
de: Der Benutzer hat bereits ein Passwort festgelegt.

source: User already in role '{role}'.
de: Benutzer bereits in Rolle '{role}'.

source: User is not in role '{role}'.
de: Der Benutzer hat nicht die Rolle „{role}“.

source: User Name '{userName}' is already taken.
de: Der Benutzername „{userName}“ ist bereits vergeben.

source: User name '{userName}' is invalid, can only contain letters or digits.
de: Benutzername '{userName}' ist ungültig, darf nur Buchstaben oder Ziffern enthalten.

source: UserNotFound
de: Benutzer nicht gefunden

source: WrongPassOrEm
de: Falsches Passwort oder E-Mail
